
public class ArrayTest4 {
	public static void main(String[] args) {
		/**
		 * 2차원 배열 초기화 
		 */
		int[][] arr1 = new int[][] {
			{10,11,12},
			{20,21,22},
			{30,31,32},
			{40,41,42},
			{50,51,52}
		};
		
		//new int[][] 생략 가능 
		int[][] arr2 = {
			{10,11,12},
			{20,21,22},
			{30,31,32},
			{40,41,42},
			{50,51,52}
		};
		
		//선언과 값 초기화 분리 가
		int[][] arr3;
		arr3 = new int[][] {
			{10,11,12},
			{20,21,22},
			{30,31,32},
			{40,41,42},
			{50,51,52}
		};
		
		//선언과 배열 생성 분리시 new int[][] 생략 불가 
//		int[][] arr4;
//		arr4 = {
//			{10,11,12},
//			{20,21,22},
//			{30,31,32},
//			{40,41,42},
//			{50,51,52}
//		};
	}
}
